<a href="https://colab.research.google.com/github/ricardosimplicio/PUC-Rio-MVP-Engenharia_de_Dados/blob/main/Exerc%C3%ADcio_BD_Aula2_Ricardo_Simplicio.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Banco de Dados - Prof. Sérgio Lifschitz

---

## Exercícios da Aula 2: Projeto Conceitual e Linguagem SQL DDL (criação e atualização de esquemas) e SQL DML (atualização de instâncias)

**Primeira Parte:** Projeto Conceitual com Diagramas ER

Acesse o enunciado do exercício no seguinte link: https://drive.google.com/file/d/1Sd8Nd1nraKALk-GqRszRCu4MZqmBDBE5/view?usp=sharing

Você irá praticar com a ferramenta BRmodelo.

Ao final deste COLAB, publicamos uma possível solução.

**Segunda Parte:** Voltamos a utilizar o SGBD PostgreSQL localmente.

Para a prática de SQL DML (atualização de instâncias) usando um esquema similar ao esquema CARROS da Aula 1.

## PASSO 1: Instalação e Configuração do PostgreSQL

Basta dar PLAY que o script abaixo instalará o SGBD PostgreSQL

In [ ]:
# %%capture
# Instalação do PostgreSQL
!sudo apt-get -y -qq update
!pip install sqlalchemy==2.0
!sudo apt-get -y -qq install postgresql
!sudo service postgresql start
# Alterando a senha do usuário padrão 'postgres' para 'postgres'
!sudo -u postgres psql -U postgres -c "ALTER USER postgres PASSWORD 'postgres';"

Requirement already satisfied: sqlalchemy==2.0 in /usr/local/lib/python3.10/dist-packages (2.0.0)
Requirement already satisfied: typing-extensions>=4.2.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy==2.0) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy==2.0) (3.0.3)
 * Starting PostgreSQL 14 database server
   ...done.
ALTER ROLE

## PASSO 2: Preparo do Esquema Relacional CARROS2

Acesse o enunciado do exercício no seguinte link: https://drive.google.com/file/d/1B0OFWhCV8zOLt0FQ5KvCutLPhuMveZ84/view?usp=sharing

Diferentemente da aula 1, aqui você irá utilizar os comandos de criação do esquema CARROS2 propostos por você no seu próprio COLAB, seguindo as instruções do enunciado da Lista da Aula 2. Você pode utilizar os scripts do esquema CARROS da Aula 1 apenas como referência de "gabarito".

Os demais comandos (PLAY) de criação do esquema do BD Carros2 seguem iguais à aula 1.

In [ ]:
# Cria o esquema no banco de dados
%%capture
!sudo -u postgres psql -U postgres -c 'DROP SCHEMA IF EXISTS carros CASCADE;'
!sudo -u postgres psql -U postgres -c 'CREATE SCHEMA carros;'

## PASSO 3: Preparando para usar o SGBD PostgreSQL localmente

Aqui nada muda em relação à Aula 1 - configuração para extensão SQL usando o SGBD PostgreSQL no seu COLAB.

In [ ]:
# Configurando o PostgreSQL na variável de ambiente DATABASE_URL
%env DATABASE_URL=postgresql://postgres:postgres@localhost:5432/postgres

env: DATABASE_URL=postgresql://postgres:postgres@localhost:5432/postgres

In [ ]:
# Carregando a extensão sql para usar o SQL pelo Google Colab
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

## Prática de SQL DDL (esquemas) e DML (instâncias)

Criação e atualização do esquema CARROS2 implantado no SGBD PostgreSQL, seguindo as instruções dos exercícios desta aula 2.

In [ ]:
%sql postgresql://postgres:postgres@localhost:5432/postgres

In [ ]:
# Escolhe o esquema carros como o esquema em que serão feitas as consultas
# (deve-se executar essa célula sempre que for trocar para o esquema carros)
%%sql
SET SCHEMA 'carros';

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [ ]:
# Exemplo de CREATE TABLE:

# Você pode modificar e adaptar ao teu próprio comando.

%%sql

CREATE TABLE carros.automoveis (
    codigo varchar(10) NOT NULL,
    fabricante character(20),
    modelo character(20),
    ano character(2),
    pais character(20),
    preco_tabela numeric(8,2)
);

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [ ]:
%%sql

CREATE TABLE carros.revendedoras (
    cnpj varchar(18) NOT NULL,
    nome character(20) NOT NULL,
    cpf_proprietario character(50),
    estado character(2)
);

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [ ]:
%%sql

CREATE TABLE carros.consumidores (
    cpf varchar(14) NOT NULL,
    nome character(20) NOT NULL,
    sobrenome character(70),
    data_nascimento varchar(10),
    estado character(2)
);

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [ ]:
%%sql

CREATE TABLE carros.negocios (
    cpf_comprador varchar(14) NOT NULL,
    cnpj_revenda varchar(18) NOT NULL,
    Cdigo_Auto character(10),
    Ano_Auto character(2),
    data varchar(10),
    preco money
);

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [ ]:
%%sql

CREATE TABLE carros.garagens (
    cnpj_revenda varchar(18) NOT NULL,
    Cdigo_Auto character(10),
    Ano_Auto character(2),
    quantidade integer
);

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [ ]:
%%sql

select *
from carros.garagens;

 * postgresql://postgres:***@localhost:5432/postgres
0 rows affected.

[]

In [ ]:
%%sql

INSERT INTO
AUTOMOVEIS
VALUES
('578-530','FIAT','UNO','17','BRASIL','32000'),
('679-355','VW','POLO','18','BRASIL','45000'),
('18-673','CHEVY','ONIX','19','BRASIL','126000'),
('560-225','FORD','KA','12','BRASIL','23000'),
('170-824','GURGEL','NIVA','84','RUSSIA','99000'),
('33-215','CHERY','TIGGO','11','CHINA','15000'),
('270-513','BYD','YAN','23','CHINA','96000'),
('68-957','CHEVROLET','PRISMA','24','BRASIL','85000'),
('144-223','JAC','T40','22','CHINA','145000'),
('238-473','CITROEN','C4','17','FRANÇA','68000');

 * postgresql://postgres:***@localhost:5432/postgres
10 rows affected.

[]

In [ ]:
%%sql

INSERT INTO
revendedoras
VALUES
('74.293.633/0001-71','XUXU','444.244.930-91','PE'),
('60.096.511/0001-80','CECE','521.662.160-13','MG'),
('54.403.936/0001-92','AUAU','316.303.410-10','DF'),
('21.738.832/0001-80','BEBE','985.434.380-47','SP'),
('99.445.663/0001-87','LULU','220.285.940-39','RJ'),
('05.489.418/0001-28','CACA','278.510.150-22','RO'),
('91.352.280/0001-52','NONO','768.972.440-07','RR'),
('85.107.412/0001-88','MEME','191.217.660-29','AC'),
('02.815.703/0001-01','JAJA','083.638.310-93','MA'),
('90.152.153/0001-47','POPO','986.313.790-18','AM');

 * postgresql://postgres:***@localhost:5432/postgres
10 rows affected.

[]

In [ ]:
%%sql

INSERT INTO
CONSUMIDORES
VALUES
('168.727.930-66','BABA','MOMO','26/08/1965','PE'),
('093.213.150-63','RORO','RARA','30/06/1942','DF'),
('737.578.190-71','KAKA','TETE','31/08/1972','MG'),
('645.304.260-68','TOTO','PEPE','30/05/1963','BA'),
('450.452.860-64','DEDE','XIXI','12/02/1996','PB'),
('639.687.610-81','DIDI','MOCO','10/09/2014','RN'),
('699.572.080-63','ZACARIA','BOBO','20/12/1974','RS');

 * postgresql://postgres:***@localhost:5432/postgres
7 rows affected.

[]

In [ ]:
%%sql

INSERT INTO
CONSUMIDORES
VALUES
('314.278.000-90','MUSSUM','PEPE','09/05/1978','AC'),
('080.138.240-80','HEBE','CARMAGO','26/12/1946','GO'),
('196.112.960-45','XUXA','MENEGUEL','12/04/1970','GO');

 * postgresql://postgres:***@localhost:5432/postgres
3 rows affected.

[]

In [ ]:
%%sql

INSERT INTO
NEGOCIOS
VALUES


('737.578.190-71','21.738.832/0001-80','679-355','18','12/03/2023','23000'),
('699.572.080-63','91.352.280/0001-52','238-473','17','15/04/2024','36000'),
('080.138.240-80','85.107.412/0001-88','144-223','22','16/01/2015','45000'),
('093.213.150-63','90.152.153/0001-47','560-225','12','10/04/2023','85000'),
('168.727.930-66','74.293.633/0001-71','679-355','18','20/05/2019','96000');

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[]

In [ ]:
%%sql

INSERT INTO
GARAGENS
VALUES

('02.815.703/0001-01','68-957','24','3'),
('54.403.936/0001-92','144-223','22','6'),
('74.293.633/0001-71','578-530','17','9'),
('21.738.832/0001-80','238-473','17','18'),
('05.489.418/0001-28','33-215','11','4');

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[]

In [ ]:
%%sql

SELECT *
FROM AUTOMOVEIS
ORDER BY FABRICANTE;

 * postgresql://postgres:***@localhost:5432/postgres
10 rows affected.

[('270-513', 'BYD                 ', 'YAN                 ', '23', 'CHINA               ', Decimal('96000.00')),
 ('33-215', 'CHERY               ', 'TIGGO               ', '11', 'CHINA               ', Decimal('15000.00')),
 ('68-957', 'CHEVROLET           ', 'PRISMA              ', '24', 'BRASIL              ', Decimal('85000.00')),
 ('18-673', 'CHEVY               ', 'ONIX                ', '19', 'BRASIL              ', Decimal('126000.00')),
 ('238-473', 'CITROEN             ', 'C4                  ', '17', 'FRANÇA              ', Decimal('68000.00')),
 ('578-530', 'FIAT                ', 'UNO                 ', '17', 'BRASIL              ', Decimal('32000.00')),
 ('560-225', 'FORD                ', 'KA                  ', '12', 'BRASIL              ', Decimal('23000.00')),
 ('170-824', 'GURGEL              ', 'NIVA                ', '84', 'RUSSIA              ', Decimal('99000.00')),
 ('144-223', 'JAC                 ', 'T40                 ', '22', 'CHINA               ', Decimal('145000.00')),
 ('679-355', 'VW                  ', 'POLO                ', '18', 'BRASIL              ', Decimal('45000.00'))]

In [ ]:
%%sql

UPDATE
automoveis
SET MODELO = 'palio'
where modelo = 'UNO';

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[]

In [ ]:
%%sql

delete from
automoveis
where modelo = 'palio';

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[]

In [ ]:
%%sql

INSERT INTO
AUTOMOVEIS
VALUES
('578-530','FIAT','UNO','17','BRASIL','32000');

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[]

In [ ]:
%%sql

select *
from automoveis
order by modelo;

 * postgresql://postgres:***@localhost:5432/postgres
10 rows affected.

[('238-473', 'CITROEN             ', 'C4                  ', '17', 'FRANÇA              ', Decimal('68000.00')),
 ('560-225', 'FORD                ', 'KA                  ', '12', 'BRASIL              ', Decimal('23000.00')),
 ('170-824', 'GURGEL              ', 'NIVA                ', '84', 'RUSSIA              ', Decimal('99000.00')),
 ('18-673', 'CHEVY               ', 'ONIX                ', '19', 'BRASIL              ', Decimal('126000.00')),
 ('679-355', 'VW                  ', 'POLO                ', '18', 'BRASIL              ', Decimal('45000.00')),
 ('68-957', 'CHEVROLET           ', 'PRISMA              ', '24', 'BRASIL              ', Decimal('85000.00')),
 ('144-223', 'JAC                 ', 'T40                 ', '22', 'CHINA               ', Decimal('145000.00')),
 ('33-215', 'CHERY               ', 'TIGGO               ', '11', 'CHINA               ', Decimal('15000.00')),
 ('578-530', 'FIAT                ', 'UNO                 ', '17', 'BRASIL              ', Decimal('32000.00')),
 ('270-513', 'BYD                 ', 'YAN                 ', '23', 'CHINA               ', Decimal('96000.00'))]

In [ ]:
%%sql

ALTER TABLE AUTOMOVEIS
ADD CONSTRAINT PK_AUTOMOVEIS PRIMARY KEY (CODIGO, ANO);

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [ ]:
%%sql

SELECT *
FROM CONSUMIDORES;

 * postgresql://postgres:***@localhost:5432/postgres
10 rows affected.

[('168.727.930-66', 'BABA                ', 'MOMO                                                                  ', '26/08/1965', 'PE'),
 ('093.213.150-63', 'RORO                ', 'RARA                                                                  ', '30/06/1942', 'DF'),
 ('737.578.190-71', 'KAKA                ', 'TETE                                                                  ', '31/08/1972', 'MG'),
 ('645.304.260-68', 'TOTO                ', 'PEPE                                                                  ', '30/05/1963', 'BA'),
 ('450.452.860-64', 'DEDE                ', 'XIXI                                                                  ', '12/02/1996', 'PB'),
 ('639.687.610-81', 'DIDI                ', 'MOCO                                                                  ', '10/09/2014', 'RN'),
 ('699.572.080-63', 'ZACARIA             ', 'BOBO                                                                  ', '20/12/1974', 'RS'),
 ('314.278.000-90', 'MUSSUM              ', 'PEPE                                                                  ', '09/05/1978', 'AC'),
 ('080.138.240-80', 'HEBE                ', 'CARMAGO                                                               ', '26/12/1946', 'GO'),
 ('196.112.960-45', 'XUXA                ', 'MENEGUEL                                                              ', '12/04/1970', 'GO')]

In [ ]:
%%sql

ALTER TABLE REVENDEDORAS
ADD CONSTRAINT PK_REVENDEDORAS PRIMARY KEY (CNPJ);

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [ ]:
%%sql

ALTER TABLE CONSUMIDORES
ADD CONSTRAINT PK_CONSUMIDORES PRIMARY KEY (CPF);

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [ ]:
%%sql

show table negocios;

 * postgresql://postgres:***@localhost:5432/postgres
(psycopg2.errors.SyntaxError) syntax error at or near "table"
LINE 1: show table negocios;
             ^

[SQL: show table negocios;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [ ]:
%%sql

SELECT
  column_name,
  data_type
FROM information_schema.columns
WHERE table_name = 'NEGOCIOS';

 * postgresql://postgres:***@localhost:5432/postgres
0 rows affected.

[]

In [ ]:
%%sql

\\d+ 'negocios';

 * postgresql://postgres:***@localhost:5432/postgres

ImportError: pgspecial not installed

In [ ]:
# prompt: preciso dos nomes das colunas e do tipo de dado da tabela negocios

%%sql

SELECT column_name, data_type, is_nullable
FROM information_schema.columns
WHERE table_name = 'negocios';

 * postgresql://postgres:***@localhost:5432/postgres
6 rows affected.

[('preco', 'money', 'YES'),
 ('cpf_comprador', 'character varying', 'NO'),
 ('cnpj_revenda', 'character varying', 'NO'),
 ('cdigo_auto', 'character', 'YES'),
 ('ano_auto', 'character', 'YES'),
 ('data', 'character varying', 'YES')]

In [ ]:
%%sql

ALTER TABLE NEGOCIOS


ADD CONSTRAINT FK_CNPJ_REVEN
FOREIGN KEY (CNPJ_REVENDA) REFERENCES REVENDEDORAS(CNPJ),
ADD CONSTRAINT FK_CODIGOAUTO
FOREIGN KEY (CDIGO_AUTO, Ano_Auto) REFERENCES AUTOMOVEIS(CODIGO, ano);

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

**Parte 1: Modelagem Conceitual**

Segue SUGESTÃO de solução de modelagem conceitual ER usando a ferramenta BRmodelo.

https://drive.google.com/file/d/10-lx_mCLC4svbnopnlBKxtfsBJGqdbXt/view?usp=sharing